{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder for future backend functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: 3D logo conversion in header and 3D motorcycle models in gallery, both using Three.js and React Three Fiber.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component purposes, data structures, and styling configurations.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining light and dark theme variables for black background, white text, and red accent colors.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Karthikeyan Bike Sale application.",
  "frontend/src/App.tsx": "Root React component rendering the complete page layout with Header, HeroBanner, BikeGallery, ContactSection, and Footer components on a black background.",
  "frontend/src/components/BikeCard.tsx": "Bike card component displaying a 3D motorcycle model, bike specifications, price, and enquiry button with hover effects and responsive layout.",
  "frontend/src/components/BikeGallery.tsx": "Gallery section component rendering a responsive grid of BikeCard components with title, description, and decorative elements.",
  "frontend/src/components/BikeModel3D.tsx": "React Three Fiber component rendering a 3D motorcycle model with color customization, auto-rotation animation, interactive OrbitControls, and metallic materials.",
  "frontend/src/components/ContactSection.tsx": "Contact information section displaying phone number, Instagram handle, and showroom address in a three-column grid with call-to-action button.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Fixed header component with 3D rotating logo, branding text, phone number, and Instagram handle with responsive design and backdrop blur.",
  "frontend/src/components/HeroBanner.tsx": "Full-viewport hero section with background image, bold branding text, call-to-action buttons, and smooth scroll functionality to gallery.",
  "frontend/src/components/Logo3D.tsx": "React component that renders a 3D rotating cylindrical logo using React Three Fiber, with a texture-mapped metallic surface and ambient/directional lighting.",
  "frontend/src/data/bikes.ts": "Defines the Bike interface and exports an array of three sport bike models with specifications (engine, power, weight) and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider for ICP, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file intended for future React Query hooks when backend functionality is implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark-themed color palette using OKLCH color space, including sidebar, chart, and UI component colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking two completed features: converting the header logo and bike gallery cards to 3D rendered elements using Three.js and React Three Fiber."
}